// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "승인";
"CANCEL_BUTTON"		= "취소";
"GOBACK_BUTTON"		= "뒤로";
"DIAGNOSE_BUTTON"	= "진단";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "이 컴퓨터 구성 중...";
"MESSAGE_PREP_CONNECTION"	= "연결 준비 중...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "예기치 못한 오류";
"MESSAGE_FATAL_ERROR_TITLE"		= "죄송합니다, 예기치 못한 오류가 발생하였습니다.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "오류";
"ERROR_MESSAGE_GENERIC_TITLE"			= "죄송합니다...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "죄송합니다";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "경고";
"ERROR_MESSAGE_VALIDATION_WARNING" = "계속하겠습니까?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "필요한 정보가 모두 입력되지 않았습니다.";
"ERROR_MESSAGE_VALIDATION_0001" = "빨간색 화살표로 표시된 입력란을 확인하고 필요한 정보를 입력하십시오.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "입력된 텍스트가 너무 짧습니다.";
"ERROR_MESSAGE_VALIDATION_0002" = "선택된 입력란을 확인하고 입력한 텍스트를 바르게 고치십시오.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "입력한 정보가 틀립니다.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "입력한 사용자 이름이 유효하지 않습니다.";
"ERROR_MESSAGE_VALIDATION_0004" = "선택된 입력란을 확인하고 NetInfo 네트워크를 위한 유효한 사용자 이름을 입력하십시오.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "입력한 암호가 올바르지 않습니다.";
"ERROR_MESSAGE_VALIDATION_0005" = "선택된 입력란을 확인하고 올바른 암호를 입력하십시오.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "입력한 이름을 사용할 수 없습니다.";
"ERROR_MESSAGE_VALIDATION_0006" = "선택된 입력란을 확인하고 다른 ID를 선택하십시오.";
"ERROR_MESSAGE_VALIDATION_0007" = "이 ID를 가진 사용자가 이미 존재합니다. 다른 ID를 입력하십시오.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "입력한 IP 주소가 비어 있습니다.";
"ERROR_MESSAGE_VALIDATION_0010" = "입력한 IP 주소에 유효하지 않은 문자가 포함되어 있습니다.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "주소는 4개의 세그먼트를 포함해야 합니다."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "선택된 입력란을 확인하고 유효한 주소를 입력하십시오. 이 정보를 모르는 경우, 네트워크 관리자에게 문의하십시오.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "주소는 4개의 세그먼트를 포함해야 합니다."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "선택된 입력란을 확인하고 유효한 주소를 입력하십시오. 이 정보를 모르는 경우, 네트워크 관리자에게 문의하십시오.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "주소의 각 세그먼트에는 1~3개의 문자가 포함되어야 합니다."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "선택된 입력란을 확인하고 유효한 주소를 입력하십시오. 이 정보를 모르는 경우, 네트워크 관리자에게 문의하십시오.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "입력한 주소가 허용되지 않습니다.";
"ERROR_MESSAGE_VALIDATION_0014" = "선택된 입력란을 확인하고 유효한 주소를 입력하십시오. 이 정보를 모르는 경우, 네트워크 관리자에게 문의하십시오.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "입력한 서브네트 마스크가 유효하지 않습니다.";
"ERROR_MESSAGE_VALIDATION_0015" = "선택된 입력란을 확인하고 유효한 서브네트 마스크를 입력하십시오. 이 정보를 모르는 경우, 네트워크 관리자에게 문의하십시오.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "입력한 이름이 이미 NetInfo 네트워크에 존재합니다. 이 이름을 사용하여 NetInfo에 로그인할 수 없을 것입니다.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "동일한 값을 입력할 수 없습니다.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "입력한 암호가 유효하지 않습니다.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "입력한 신용카드 번호를 사용할 수 없습니다.";
"ERROR_MESSAGE_VALIDATION_0019" = "선택된 필드를 확인하고 유효한 신용카드 번호를 입력하십시오.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "계정 이름은 숫자로 시작될 수 없습니다.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "입력한 이메일 주소를 사용할 수 없습니다.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP 주소와 라우터 주소가 입력한 서브네트 마스크와 맞지 않습니다. 다음 필드를 확인하고 유효한 값을 입력하십시오. \n     IP 주소\n     서브네트 마스크\n     라우터 주소\n이 정보를 모르는 경우, 네트워크 관리자에게 문의하십시오.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "입력한 이름을 사용할 수 없습니다.";
"ERROR_MESSAGE_VALIDATION_0023" = "선택된 입력란을 확인하고 다른 ID를 선택하십시오.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "동일한 값이 이미 존재합니다.";
"ERROR_MESSAGE_VALIDATION_0024" = "선택한 필드를 확인하고 고유 값을 입력하십시오.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "모뎀이 발신음을 인식할 수 없습니다.";
"MESSAGE_NO_DIAL_TONE"					= "모뎀이 연결되어 있는지 확인한 다음 승인을 클릭하십시오. 또는, 취소를 클릭하여 뒤로 가서 발신음 무시 체크상자를 선택하십시오.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "종료";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "암호가 일치하지 않습니다.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "빨간 화살표로 표시된 필드를 확인하고 두 필드에 같은 암호를 입력하십시오.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "위치 이름을 입력하십시오.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "구성 정보가 저장되는 곳에 새로운 네트워크 위치를 생성하고 있습니다. 위치 이름을 지금 입력해야 합니다.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "다른 위치 이름을 입력하십시오.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "입력한 위치 이름이 이미 존재합니다. 다른 이름을 입력하십시오.";


"MESSAGE_TASK_FORMAT" = "“%2$@을(를) 통해 %1$@ 연결”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "무선";
"CONNECTION_Modem" = "모뎀";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "케이블 모뎀";
"CONNECTION_Lan" = "LAN(근거리 통신망)";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP 클라이언트 ID:";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "고정 IP";

"MESSAGE_TITLE_CONFIGURE" = "구성 중...";
"MESSAGE_FAILED_CONFIGURE" = "구성할 수 없습니다.";
"MESSAGE_DONE_CONFIGURE" = "구성이 완료되었습니다.";
"MESSAGE_CHECKING_CONNECTION" = "네트워크 연결 점검 중...";
"MESSAGE_CONNECTED" = "네트워크가 연결되었습니다.";
"MESSAGE_NOT_CONNECTED" = "네트워크 연결을 할 수 없습니다.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "인터넷에 컴퓨터를 연결할 수 없습니다. 승인을 클릭하여 뒤로 가서 설정을 변경하고 다시 시도하십시오.";

"DEFAULT_LOCATION_NAME" = "위치(%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";